;----------------
;基本設定
;----------------
[MAIN]
;啟動時隱藏
start_hidden = 0
;顯示/隱藏 系統圖示
show_tray_icon = 1

;按下 Shift 後，多少時間內放開才會被視為
;進行 中/英 模式的切換，以毫秒為單位
shift_hold_time = 100

;若設定為1，則用 CapsLock 做為中/英模式切換鍵，
;不要使用中/英模式切換設定成 0 即可
caps_switch = 0

;若設定為1，則用左邊 Shift 做為中/英模式切換鍵，
;不要使用中/英模式切換設定成 0 即可
shift_switch = 1
;若設定為1，則用右邊 Shift 做為中/英模式切換鍵。
rshift_switch = 0

;設定為1，Shift + ,.[]' 為送下排符號
;設定為0，Shift + ,.[]' 為送上排符號
shift_altered = 1

;數字鍵盤在全形模式下輸出模式
;0 = 半形，1 = 全形
numpad_in_full_width = 1

;若設定為1，則使用內部vrsf選字擴充功能，
;即 shift + [vrsfwlcbk] 其中一鍵來選字。
;不使用設定為 0
shift_vrsf = 1

;有輸入字根時，按 Enter 鍵可直接送出字根
;搭配 Shift 可送出小寫
;搭配 Ctrl 可送出第一字母大寫，其餘小寫
enter_send_key = 1

;修正系統內建輸入法狀態讓嘸蝦殼能正常使用
;設定值為 1 或 2，分別代表方法 1 與方法 2，
;其中一種不行可以換另一種修正方法。
;若不需要使用設定成 0 即可
sys_ime_patch = 0

;設定剪貼簿模式下，貼上的熱鍵種類
;1 = Shift + Insert
;2 = Control + v
;多數程式都支援1，一般設定為 1 即可
paste_hotkey_type = 1

;選字區一次顯示多少可選字，範圍 1~10
sel_num = 10

;是否顯示所有拆碼，後續可以用熱鍵切換
show_key_list = 0
;顯示拆碼時，多少字根數以下才會顯示。
;同音查詢和萬用碼查詢不在此限。
key_list_len = 3

;游標跟隨模式，1開啟，0關閉
;如果不支援游標跟隨，會以固定位置顯示。
floating_mode = 1
;游標跟隨模式開啟時，輸入介面顯示位置偏移量調整
;可依個人習慣調整
floating_offset_x = 0
floating_offset_y = 0

;剪貼簿模式送字前是否保留原本剪貼簿內容
;不需要保留設定為 0 即可
keep_clip = 1
;----------------
;介面外觀設定
;----------------
[Style]
;選字區可選字之間的間隔
sel_gap = 10
;顯示拆碼和注音時，各拆碼和注音間的間距。
list_gap = 15

;選字區選字編號縮放值，最大值1
sel_num_scaler = 0.8
;sel_num_scaler = 1

;設定字型名稱
;如果字型不在系統中，可指定 TTF 或 TTC 檔名。
;字型檔放在和執行檔同路徑的 font 資料夾中
;當 font_file 設定時，font_name 不使用。
;程式內部會預設套用微軟正黑體
font_name = 標楷體
;font_file =

;設定字體大小
font_size = 30

;輸入列背景色的透明度, 0為無背景色
transparent = 255
;transparent = 0

;選字區文字顏色與背景色
;sel_text_color = eaf1b3
sel_text_color = ffff00
bg_color = 191919
;選字區編號顏色
;sel_num_color = a0b0f6
sel_num_color = aaaa00
;字根區文字顏色與背景色
;key_color = DFE6AA
key_color = ffff00
key_bg_color = 303030

;顯示文字輪廓
draw_outline = 0
;文字輪廓筆畫寬度，最值1，建義寬度為字體大小的1/10
draw_outline_width = 3
;選字區文字輪廓顏色
sel_outline_color = 202020
;字根區文字輪廓顏色
key_outline_color = 300303

;輸入列背景與文字額外間距
;可依需求微調增加
text_margin_x = 2
text_margin_y = 0

;輸入列背景框的圓角設定
rounded_corner = 3
;----------------
;表格檔對應設定
;----------------
[Table]
;phon﹑user﹑default 三個設定值為程式內部所必須，可以指定表格檔。
phon=phon
user=user
;預設載入表格，會載入 tbl\LiuCJK.txt 並於輸入列顯示 [嘸]，最後面的1是啟用內建vrsf選字擴充
default=LiuCJK,嘸,1
;下面是自訂加入的表格，分別用 ,,c 與 ,,j 可以切換至該表格，1拿掉即停用vrsf選字擴充
,,c=LiuT2S,簡
,,j=LiuJAP,日

;----------------
;功能碼自訂
;----------------
[CmdKey]
;預設表格
cmd_deftbl = ,,t
;重新載入
cmd_reload = ,,rld
;離開程式
cmd_exit = ,,xx
;編輯加字加詞檔
cmd_box = ,,box
;編輯INI檔
cmd_ini = ,,ini
;送字後顯示拆碼
cmd_list = ,,lst
;輸入列回到左下角
cmd_pos = ,,p
;剪貼簿模式
cmd_clipmode = ,,b
;跟隨游標切換
cmd_floating = ,,ff
